{
    "products": [
        {
            "name": "deploy-arch-ibm-hpc",
            "label": "HPC Deployable Architecture",
            "product_kind": "solution",
            "tags": [
                "Deployable Architecture",
                "DA",
                "HPC",
                "IBM Cloud HPC",
                "ibm_created",
                "target_terraform",
                "terraform",
                "reference_architecture",
                "solution"
            ],
            "keywords": [
                "HPC",
                "vpc",
                "DA",
                "Deployable Architecture",
                "terraform",
                "solution"
            ],
            "short_description": "Deploy your high performance computing (HPC) cluster with IBM scheduling software for compute intensive workloads.",
            "long_description": "**Before you begin deploying IBM Cloud HPC, make sure that you meet the prerequisites listed in [the step-by-step guide](https://cloud.ibm.com/docs/allowlist/hpc-service?topic=hpc-service-before-you-begin-deploying).**\n\nIBM Cloud HPC is a deployable architecture where you can deploy both cloud compute resources (vCPU resources) and HPC scheduling software for your compute-intensive HPC workloads. You can reserve capacity on a recurring hourly basis from a dedicated IBM Cloud HPC resource pool.",
            "provider_name": "IBM",
            "offering_docs_url": "https://cloud.ibm.com/docs/allowlist/hpc-service?topic=hpc-service-overview",
            "features": [
                {
                    "title": "Reserve HPC compute on an hourly basis",
                    "description": "Reserve HPC compute capacity on a recurring hourly basis. This reserved time slot and capacity cannot be preempted by IBM."
                },
                {
                    "title": "HPC infrastructure bundled with LSF scheduling software",
                    "description": "Create a cluster with IBM Spectrum LSF in its own subnet and security group for HPC administrators to log in, submit, and manage HPC jobs."
                },
                {
                    "title": "Automatic compute scaling with LSF resource connector",
                    "description": "Automatically scale up compute resources based on workload demand. Compute resources are automatically scaled down when no longer required."
                }
            ],
            "flavors": [
                {
                    "label": "Advanced",
                    "name": "advanced",
                    "install_type": "fullstack",
                    "working_directory": "solutions/hpc",
                    "compliance": {
                        "authority": "scc-v3",
                        "profiles": [
                            {
                                "profile_name": "IBM Cloud Framework for Financial Services",
                                "profile_version": "1.6.0"
                            }
                        ]
                    },
                    "release_notes_url": "https://cloud.ibm.com/docs/allowlist/hpc-service?topic=hpc-service-release-notes",
                    "configuration": [
                        {
                            "key": "ibmcloud_api_key",
                            "type": "password",
                            "description": "IBM Cloud API Key that will be used for authentication in scripts run in this module. Only required if certain options are required.",
                            "required": true
                        },
                        {
                            "key": "resource_group",
                            "type": "string",
                            "description": "Resource group name from your IBM Cloud account where the VPC resources should be deployed. Note. If the resource group value is set as null, automation creates two different RG with the name (workload-rg and service-rg). For additional information on resource groups, see [Managing resource groups](https://cloud.ibm.com/docs/account?topic=account-rgs)",
                            "required": true
                        },
                        {
                            "key": "contract_id",
                            "type": "password",
                            "description": "Ensure that you have received the contract ID from IBM technical sales. Contract ID is a unique identifier to distinguish different IBM Cloud HPC service agreements. It must start with a letter and can only contain letters, numbers, hyphens (-), or underscores (_)",
                            "required": true
                        },
                        {
                            "key": "cluster_id",
                            "type": "string",
                            "description": "Ensure that you have received the cluster ID from IBM technical sales. A unique identifer for HPC cluster used by IBM Cloud HPC to differentiate different HPC clusters within the same contract. This can be up to 39 alphanumeric characters including the underscore (_), the hyphen (-), and the period (.) characters. You cannot change the cluster ID after deployment",
                            "required": true
                        },
                        {
                            "key": "bastion_ssh_keys",
                            "type": "list(string)",
                            "description": "List of names of the SSH keys that is configured in your IBM Cloud account, used to establish a connection to the IBM Cloud HPC bastion and login node. Ensure that the SSH key is present in the same resource group and region where the cluster is being provisioned. If you do not have an SSH key in your IBM Cloud account, create one by according to SSH Keys",
                            "required": true
                        },
                        {
                            "key": "compute_ssh_keys",
                            "type": "list(string)",
                            "description": "List of names of the SSH keys that is configured in your IBM Cloud account, used to establish a connection to the IBM Cloud HPC cluster node. Ensure that the SSH key is present in the same resource group and region where the cluster is being provisioned. If you do not have an SSH key in your IBM Cloud account, create one by according to SSH Keys",
                            "required": true
                        },
                        {
                            "key": "remote_allowed_ips",
                            "type": "list(string)",
                            "description": "Comma-separated list of IP addresses that can access the IBM Cloud HPC cluster instance through an SSH interface. For security purposes, provide the public IP addresses assigned to the devices that are authorized to establish SSH connections (for example, [\"169.45.117.34\"]). To fetch the IP address of the device, use https://ipv4.icanhazip.com/",
                            "required": true
                        },
                        {
                            "key": "zones",
                            "type": "list(string)",
                            "description": "IBM Cloud zone names within the selected region where the IBM Cloud HPC cluster should be deployed. Two zone names are required as input value and supported zones for eu-de are eu-de-2, eu-de-3 and for us-east us-east-1, us-east-3. The management nodes and file storage shares will be deployed to the first zone in the list. Compute nodes will be deployed across both first and second zones, where the first zone in the list will be considered as the most preferred zone for compute nodes deployment. Learn more",
                            "required": true
                        }
                    ],
                    "iam_permissions": [
                        {
                            "role_crns": [
                                "crn:v1:bluemix:public:iam::::serviceRole:Manager"
                            ],
                            "service_name": "Schematics"
                        },
                        {
                            "role_crns": [
                                "crn:v1:bluemix:public:iam::::serviceRole:writer"
                            ],
                            "service_name": "cloud-object-storage"
                        },
                        {
                            "role_crns": [
                                "crn:v1:bluemix:public:iam::::serviceRole:Manager"
                            ],
                            "service_name": "DNS Services"
                        },
                        {
                            "role_crns": [
                                "crn:v1:bluemix:public:iam::::serviceRole:Manager"
                            ],
                            "service_name": "IBM Key Protect"
                        },
                        {
                            "role_crns": [
                                "crn:v1:bluemix:public:iam::::role:Administrator"
                            ],
                            "service_name": "Project"
                        },
                        {
                            "role_crns": [
                                "crn:v1:bluemix:public:iam::::role:Editor"
                            ],
                            "service_name": "is.vpc"
                        },
                        {
                            "role_crns": [
                                "crn:v1:bluemix:public:iam::::role:Editor"
                            ],
                            "service_name": "DNS Services"
                        },
                        {
                            "role_crns": [
                                "crn:v1:bluemix:public:iam::::role:Viewer"
                            ],
                            "service_name": "Global Catalog"
                        }
                    ],
                    "architecture": {
                        "descriptions": "",
                        "features": [
                            {
                                "title": "Separate VPC for HPC workloads",
                                "description": "Yes"
                            },
                            {
                                "title": "Virtual Server Instances for every subnet",
                                "description": "Yes"
                            },
                            {
                                "title": "Increases security with Key Management",
                                "description": "Yes"
                            },
                            {
                                "title": "Reduces failure events by using multizone regions",
                                "description": "Yes"
                            },
                            {
                                "title": "Collects and stores Internet Protocol (IP) traffic information with Activity Tracker and Flow Logs",
                                "description": "Yes"
                            },
                            {
                                "title": "Securely connects to multiple networks with a site-to-site virtual private network",
                                "description": "Yes"
                            },
                            {
                                "title": "Simplifies risk management and demonstrates regulatory compliance with Financial Services",
                                "description": "Yes"
                            },
                            {
                                "title": "Uses Floating IP address for access through the public internet",
                                "description": "No"
                            }
                        ],
                        "diagrams": [
                            {
                                "diagram": {
                                    "caption": "HPC variation",
                                    "url": "https://raw.githubusercontent.com/terraform-ibm-modules/terraform-ibm-hpc/review/hpcaas-arch-1.4.0.svg",
                                    "type": "image/svg+xml"
                                },
                                "description": "The HPC variation of the deployable architecture is based on the IBM Cloud for Financial Services reference architecture. The architecture creates a customizable and secure infrastructure, with virtual servers, to run your workloads with a Virtual Private Cloud (VPC) in multizone regions."
                            }
                        ]
                    }
                }
            ]
        }
    ]
}
