{
  "name": "lsf-test",
  "type": [
    "terraform_v1.9"
  ],
  "location": "eu-de",
  "resource_group": "Default",
  "description": "",
  "tags": [],
  "template_repo": {
    "url": "https://github.com/terraform-ibm-modules/terraform-ibm-hpc",
    "branch": "main"
  },
  "template_data": [
    {
      "folder": "solutions/lsf",
      "type": "terraform_v1.9",
      "env_values": [
        {
          "TF_CLI_ARGS_apply": "-parallelism=250"
        },
        {
          "TF_CLI_ARGS_plan": "-parallelism=250"
        },
        {
          "TF_CLI_ARGS_destroy": "-parallelism=100"
        },
        {
          "VAR1": "<val1>"
        },
        {
          "VAR2": "<val2>"
        }
      ],
      "variablestore": [
        {
          "name": "TF_PARALLELISM",
          "value": "250",
          "type": "string",
          "secure": false,
          "description": "Parallelism concurrent operations limit. Valid values are between 1 and 256, both inclusive. [Learn more](https://www.terraform.io/docs/internals/graph.html#walking-the-graph)."
        },
        {
          "name": "TF_VERSION",
          "value": "1.9",
          "type": "string",
          "secure": false,
          "description": "The version of the Terraform engine that's used in the Schematics workspace."
        },
        {
          "name": "ibmcloud_api_key",
          "value": "Please fill here",
          "type": "string",
          "secure": true,
          "description": "Provide the IBM Cloud API key associated with the account to deploy the IBM Spectrum LSF cluster. This key is used to authenticate your deployment and grant the necessary access to create and manage resources in your IBM Cloud environment, see [Managing user API keys](https://cloud.ibm.com/docs/account?topic=account-userapikey)."
        },
        {
          "name": "existing_resource_group",
          "value": "Default",
          "type": "string",
          "secure": false,
          "description": "Specify the existing resource group name from your IBM Cloud account where the VPC resources should be deployed. By default, the resource group name is set to 'Default.' Note that in some older accounts, the resource group name may be 'default,' so please validate the resource_group name before deployment. If the resource group value is set to the string \"null\", the automation will create two different resource groups named 'workload-rg' and 'service-rg.' For more information on resource groups, refer to Managing resource groups."
        },
        {
          "name": "zone",
          "value": "[\"us-east-1\"]",
          "type": "list(string)",
          "secure": false,
          "description": "Specify the IBM Cloud zone within the chosen region where the IBM Spectrum LSF cluster will be deployed. A single zone input is required, and the management nodes, file storage shares, and compute nodes will all be provisioned in this zone.[Learn more](https://cloud.ibm.com/docs/vpc?topic=vpc-creating-a-vpc-in-a-different-region#get-zones-using-the-cli)."
        },
        {
          "name": "lsf_version",
          "value": "Fixpack_15",
          "type": "string",
          "secure": false,
          "description": "Select the desired version of IBM Spectrum LSF to deploy either fixpack_15 or fixpack_14. By default, the solution uses the latest available version, which is Fix Pack 15. If you need to deploy an earlier version such as Fix Pack 14, update the lsf_version field to fixpack_14. When changing the LSF version, ensure that all custom images used for management, compute, and login nodes correspond to the same version. This is essential to maintain compatibility across the cluster and to prevent deployment issues."
        },
        {
          "name": "ssh_keys",
          "value": "[\"Please fill here\"]",
          "type": "list(string)",
          "secure": false,
          "description": "Provide the list of SSH key names configured in your IBM Cloud account to establish a connection to the IBM Cloud HPC bastion and login node. Ensure the SSH key is present in the same resource group and region where the cluster is being provisioned. If you do not have an SSH key in your IBM Cloud account, create one by following the provided instructions.[SSH Keys](https://cloud.ibm.com/docs/vpc?topic=vpc-ssh-keys)."
        },
        {
          "name": "app_center_gui_password",
          "value": "",
          "type": "string",
          "secure": true,
          "description": "Password required to access the IBM Spectrum LSF Application Center (App Center) GUI, which is enabled by default in both Fix Pack 15 and Fix Pack 14 with HTTPS. This is a mandatory value and omitting it will result in deployment failure. The password must meet the following requirements, at least 8 characters in length, and must include one uppercase letter, one lowercase letter, one number, and one special character."
        },
        {
          "name": "remote_allowed_ips",
          "value": "[\"Please fill here\"]",
          "type": "list(string)",
          "secure": false,
          "description": "Comma-separated list of IP addresses that can access the IBM Cloud HPC cluster instance through an SSH interface. For security purposes, provide the public IP addresses assigned to the devices that are authorized to establish SSH connections (for example, [\"169.45.117.34\"]). To fetch the IP address of the device, use [https://ipv4.icanhazip.com/](https://ipv4.icanhazip.com/)."
        },
        {
          "name": "cluster_prefix",
          "value": "hpc-lsf",
          "type": "string",
          "secure": false,
          "description": "Prefix that is used to name the IBM Cloud HPC cluster and IBM Cloud resources that are provisioned to build the IBM Cloud HPC cluster instance. You cannot create more than one instance of the IBM Cloud HPC cluster with the same name. Ensure that the name is unique. Prefix must start with a lowercase letter and contain only lowercase letters, digits, and hyphens in between. Hyphens must be followed by at least one lowercase letter or digit. There are no leading, trailing, or consecutive hyphens.Character length for cluster_prefix should be less than 16."
        },
        {
          "name": "vpc_name",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Name of an existing VPC in which the cluster resources will be deployed. If no value is given, then a new VPC will be provisioned for the cluster. [Learn more](https://cloud.ibm.com/docs/vpc)"
        },
        {
          "name": "cluster_subnet_ids",
          "value": "[]",
          "type": "list(string)",
          "secure": false,
          "description": "Provide the list of existing subnet ID under the existing VPC where the cluster will be provisioned. One subnet ID is required as input value. Supported zones are: eu-de-2 and eu-de-3 for eu-de, us-east-1 and us-east-3 for us-east, and us-south-1 for us-south. The management nodes, file storage shares, and compute nodes will be deployed in the same zone."
        },
        {
          "name": "login_subnet_id",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Provide the list of existing subnet ID under the existing VPC, where the login/bastion server will be provisioned. One subnet id is required as input value for the creation of login node and bastion in the same zone as the management nodes. Note: Provide a different subnet id for login_subnet_id, do not overlap or provide the same subnet id that was already provided for cluster_subnet_ids."
        },
        {
          "name": "vpc_cidr",
          "value": "10.241.0.0/18",
          "type": "string",
          "secure": false,
          "description": "Creates the address prefix for the new VPC, when the vpc_name variable is empty. The VPC requires an address prefix for creation of subnet in a single zone. The subnet are created with the specified CIDR blocks. For more information, see [Setting IP ranges](https://cloud.ibm.com/docs/vpc?topic=vpc-vpc-addressing-plan-design)."
        },
        {
          "name": "vpc_cluster_private_subnets_cidr_blocks",
          "value": "[\"10.241.0.0/20\"]",
          "type": "list(string)",
          "secure": false,
          "description": "Provide the CIDR block required for the creation of the compute cluster's private subnet. One CIDR block is required. If using a hybrid environment, modify the CIDR block to avoid conflicts with any on-premises CIDR blocks. Ensure the selected CIDR block size can accommodate the maximum number of management and dynamic compute nodes expected in your cluster. For more information on CIDR block size selection, refer to the documentation, see [Choosing IP ranges for your VPC](https://cloud.ibm.com/docs/vpc?topic=vpc-choosing-ip-ranges-for-your-vpc)."
        },
        {
          "name": "vpc_cluster_login_private_subnets_cidr_blocks",
          "value": "[\"10.241.16.0/28\"]",
          "type": "list(string)",
          "secure": false,
          "description": "Provide the CIDR block required for the creation of the login cluster's private subnet. Only one CIDR block is needed. If using a hybrid environment, modify the CIDR block to avoid conflicts with any on-premises CIDR blocks. Since the login subnet is used only for the creation of login virtual server instances, provide a CIDR range of /28."
        },
        {
          "name": "dns_domain_name",
          "value": "{compute= \"hpcaas.com\"}",
          "type": "object({compute = string})",
          "secure": false,
          "description": "IBM Cloud DNS Services domain name to be used for the IBM Cloud HPC cluster."
        },
        {
          "name": "dns_instance_id",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Provide the id of existing IBM Cloud DNS services domain to skip creating a new DNS service instance name.Note: If dns_instance_id is not equal to null, a new dns zone will be created under the existing dns service instance."
        },
        {
          "name": "dns_custom_resolver_id",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Provide the id of existing IBM Cloud DNS custom resolver to skip creating a new custom resolver. If the value is set to null, a new dns custom resolver shall be created and associated to the vpc. Note: A VPC can be associated only to a single custom resolver, please provide the id of custom resolver if it is already associated to the VPC."
        },
        {
          "name": "enable_cos_integration",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set to true to create an extra cos bucket to integrate with HPC cluster deployment."
        },
        {
          "name": "cos_instance_name",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Provide the name of the existing cos instance to store vpc flow logs."
        },
        {
          "name": "bastion_image",
          "value": "ibm-ubuntu-22-04-5-minimal-amd64-3",
          "type": "string",
          "secure": false,
          "description": "Name of the image that will be used to provision the Bastion node for the IBM LSF cluster. Only Ubuntu stock image of any version available to the IBM Cloud account in the specific region are supported."
        },
        {
          "name": "bastion_instance_profile",
          "value": "cx2-4x8",
          "type": "string",
          "secure": false,
          "description": "The virtual server instance profile type name to be used to create the Bastion node. For more information, see [Instance Profiles](https://cloud.ibm.com/docs/vpc?topic=vpc-profiles)."
        },
        {
          "name": "deployer_image",
          "value": "hpc-lsf-fp15-deployer-rhel810-v1",
          "type": "string",
          "secure": false,
          "description": "Name of the custom image to be used for creating the deployer node in the IBM LSF cluster. The solution supports only predefined custom images. By default, the deployer image is configured for fixpack_15. If you intend to deploy using fixpack_14, update the lsf_version accordingly and use the recommended image 'hpc-lsf-fp14-deployer-rhel810-v1'. Ensure that the image selected aligns with the specified lsf_version, any mismatch may lead to deployment failures."
        },
        {
          "name": "deployer_instance_profile",
          "value": "bx2-8x32",
          "type": "string",
          "secure": false,
          "description": "The virtual server instance profile type name to be used to create the deployer node. For more information, see [Instance Profiles](https://cloud.ibm.com/docs/vpc?topic=vpc-profiles&interface=ui)."
        },
        {
          "name": "management_instances",
          "value": "[{ profile = \"bx2-16x64\", count = 2, image = \"hpc-lsf-fp15-rhel810-v1\" }]",
          "type": "list(object({ profile = string, count = number, image = string }))",
          "secure": false,
          "description": "Specify the list of management node configurations, including instance profile, image name, and count. By default, all management nodes are created using Fix Pack 15. If deploying with Fix Pack 14, set lsf_version to fixpack_14 and use the corresponding image hpc-lsf-fp14-rhel810-v1. The selected image must align with the specified lsf_version, any mismatch may lead to deployment failures. The solution allows customization of instance profiles and counts, but mixing custom images and IBM stock images across instances is not supported. If using IBM stock images, only Red Hat-based images are allowed."
        },
        {
          "name": "static_compute_instances",
          "value": "[{ profile = \"bx2-4x16\", count = 0, image = \"hpc-lsf-fp15-compute-rhel810-v1\" }]",
          "type": "list(object({ profile = string, count = number, image = string }))",
          "secure": false,
          "description": "Specify the list of static compute node configurations, including instance profile, image name, and count. By default, all compute nodes are created using Fix Pack 15. If deploying with Fix Pack 14, set lsf_version to fixpack_14 and use the corresponding image hpc-lsf-fp14-compute-rhel810-v1. The selected image must align with the specified lsf_version, any mismatch may lead to deployment failures. The solution allows customization of instance profiles and counts, but mixing custom images and IBM stock images across instances is not supported. If using IBM stock images, only Red Hat-based images are allowed."
        },
        {
          "name": "dynamic_compute_instances",
          "value": "[{ profile = \"bx2-4x16\", count = 500, image = \"hpc-lsf-fp15-compute-rhel810-v1\" }]",
          "type": "list(object({ profile = string, count = number, image = string }))",
          "secure": false,
          "description": "Specify the list of dynamic compute node configurations, including instance profile, image name, and count. By default, all dynamic compute nodes are created using Fix Pack 15. If deploying with Fix Pack 14, set lsf_version to fixpack_14 and use the corresponding image hpc-lsf-fp14-compute-rhel810-v1. The selected image must align with the specified lsf_version, any mismatch may lead to deployment failures. Currently, only a single instance profile is supported for dynamic compute nodes—multiple profiles are not yet supported.."
        },
        {
          "name": "login_instance",
          "value": "[{ profile = \"bx2-2x8\", image = \"hpc-lsf-fp15-compute-rhel810-v1\" }]",
          "type": "list(object({ profile = string, count = number, image = string }))",
          "secure": false,
          "description": "Specify the list of login node configurations, including instance profile, image name. By default, login nodes is created using Fix Pack 15. If deploying with Fix Pack 14, set lsf_version to fixpack_14 and use the corresponding image hpc-lsf-fp14-compute-rhel810-v1. The selected image must align with the specified lsf_version, any mismatch may lead to deployment failures."
        },
        {
          "name": "custom_file_shares",
          "value": "[{mount_path = \"/mnt/vpcstorage/tools\", size = 100, iops = 2000 }, { mount_path = \"/mnt/vpcstorage/data\", size = 100, iops = 6000 }, { mount_path = \"/mnt/scale/tools\", nfs_share = \"\" }]",
          "type": "list(object({mount_path = string,size = optional(number),iops = optional(number),nfs_share = optional(string)}))",
          "secure": false,
          "description": "Mount points and sizes in GB and IOPS range of file shares that can be used to customize shared file storage layout. Provide the details for up to 5 shares. Each file share size in GB supports different range of IOPS. For more information, see [file share IOPS value](https://cloud.ibm.com/docs/vpc?topic=vpc-file-storage-profiles&interface=ui)"
        },
        {
          "name": "storage_security_group_id",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Provide the storage security group ID from the Spectrum Scale storage cluster when an nfs_share value is specified for a given mount_path in the cluster_file_share variable. This security group is necessary to enable network connectivity between the Spectrum LSF cluster nodes and the NFS mount point, ensuring successful access to the shared file system."
        },
        {
          "name": "enable_hyperthreading",
          "value": "true",
          "type": "bool",
          "secure": false,
          "description": "Setting this to true will enable hyper-threading in the compute nodes of the cluster (default). Otherwise, hyper-threading will be disabled."
        },
        {
          "name": "vpn_enabled",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set the value as true to deploy a VPN gateway for VPC in the cluster."
        },
        {
          "name": "key_management",
          "value": "key_protect",
          "type": "string",
          "secure": false,
          "description": "Set the value as key_protect to enable customer managed encryption for boot volume and file share. If the key_management is set as null, IBM Cloud resources will be always be encrypted through provider managed."
        },
        {
          "name": "kms_instance_name",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Provide the name of the existing Key Protect instance associated with the Key Management Service. Note: To use existing kms_instance_name set key_management as key_protect. The name can be found under the details of the KMS, see [View key-protect ID](https://cloud.ibm.com/docs/key-protect?topic=key-protect-retrieve-instance-ID&interface=ui)."
        },
        {
          "name": "kms_key_name",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Provide the existing kms key name that you want to use for the IBM Cloud HPC cluster. Note: kms_key_name to be considered only if key_management value is set as key_protect.(for example kms_key_name: my-encryption-key)."
        },
        {
          "name": "enable_vpc_flow_logs",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Flag to enable VPC flow logs. If true, a flow log collector will be created."
        },
        {
          "name": "enable_ldap",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set this option to true to enable LDAP for IBM Cloud HPC, with the default value set to false."
        },
        {
          "name": "ldap_basedns",
          "value": "lsf.com",
          "type": "string",
          "secure": false,
          "description": "The dns domain name is used for configuring the LDAP server. If an LDAP server is already in existence, ensure to provide the associated DNS domain name."
        },
        {
          "name": "ldap_server",
          "value": "null",
          "type": "string",
          "secure": false,
          "description": "Provide the IP address for the existing LDAP server. If no address is given, a new LDAP server will be created."
        },
        {
          "name": "ldap_server_cert",
          "value": "null",
          "type": "string",
          "secure": true,
          "description": "Provide the current LDAP server certificate. This is required if 'ldap_server' is not set to 'null'; otherwise, the LDAP configuration will not succeed."
        },
        {
          "name": "ldap_admin_password",
          "value": "",
          "type": "string",
          "secure": true,
          "description": "The LDAP administrative password should be 8 to 20 characters long, with a mix of at least three alphabetic characters, including one uppercase and one lowercase letter. It must also include two numerical digits and at least one special character from (~@_+:) are required. It is important to avoid including the username in the password for enhanced security.[This value is ignored for an existing LDAP server]."
        },
        {
          "name": "ldap_user_name",
          "value": "",
          "type": "string",
          "secure": false,
          "description": "Custom LDAP User for performing cluster operations. Note: Username should be between 4 to 32 characters, (any combination of lowercase and uppercase letters).[This value is ignored for an existing LDAP server]"
        },
        {
          "name": "ldap_user_password",
          "value": "",
          "type": "string",
          "secure": true,
          "description": "The LDAP user password should be 8 to 20 characters long, with a mix of at least three alphabetic characters, including one uppercase and one lowercase letter. It must also include two numerical digits and at least one special character from (~@_+:) are required.It is important to avoid including the username in the password for enhanced security.[This value is ignored for an existing LDAP server]."
        },
        {
          "name": "ldap_instance",
          "value": "[{ profile = \"cx2-2x4\", image = \"ibm-ubuntu-22-04-5-minimal-amd64-3\" }]",
          "type": "list(object({ profile = string, count = number, image = string }))",
          "secure": false,
          "description": "Specify the list of login node configurations, including instance profile, image name. By default, login nodes is created using Fix Pack 15. If deploying with Fix Pack 14, set lsf_version to fixpack_14 and use the corresponding image hpc-lsf-fp14-compute-rhel810-v1. The selected image must align with the specified lsf_version, any mismatch may lead to deployment failures."
        },
        {
          "name": "skip_iam_block_storage_authorization_policy",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "When using an existing KMS instance name, set this value to true if authorization is already enabled between KMS instance and the block storage volume. Otherwise, default is set to false. Ensuring proper authorization avoids access issues during deployment.For more information on how to create authorization policy manually, see [creating authorization policies for block storage volume](https://cloud.ibm.com/docs/vpc?topic=vpc-block-s2s-auth&interface=ui)."
        },
        {
          "name": "skip_iam_share_authorization_policy",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set it to false if authorization policy is required for VPC file share to access kms. This can be set to true if authorization policy already exists. For more information on how to create authorization policy manually, see [creating authorization policies for VPC file share](https://cloud.ibm.com/docs/vpc?topic=vpc-file-s2s-auth&interface=ui)."
        },
        {
          "name": "skip_flowlogs_s2s_auth_policy",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "When using an existing COS instance, set this value to true if authorization is already enabled between COS instance and the flow logs service. Otherwise, default is set to false. Ensuring proper authorization avoids access issues during deployment.."
        },
        {
          "name": "skip_kms_s2s_auth_policy",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "When using an existing COS instance, set this value to true if authorization is already enabled between COS instance and the kms. Otherwise, default is set to false. Ensuring proper authorization avoids access issues during deployment."
        },
        {
          "name": "scc_enable",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Flag to enable SCC instance creation. If true, an instance of SCC (Security and Compliance Center) will be created."
        },
        {
          "name": "scc_profile",
          "value": "CIS IBM Cloud Foundations Benchmark",
          "type": "string",
          "secure": false,
          "description": "Profile to be set on the SCC Instance (accepting empty, 'CIS IBM Cloud Foundations Benchmark' and 'IBM Cloud Framework for Financial Services')"
        },
        {
          "name": "scc_location",
          "value": "us-south",
          "type": "string",
          "secure": false,
          "description": "Location where the SCC instance is provisioned (possible choices 'us-south', 'eu-de', 'ca-tor', 'eu-es')"
        },
        {
          "name": "scc_event_notification_plan",
          "value": "lite",
          "type": "string",
          "secure": false,
          "description": "Event Notifications Instance plan to be used (it's used with S.C.C. instance), possible values 'lite' and 'standard'"
        },
        { "name": "observability_monitoring_enable",
          "value": "true",
          "type": "bool",
          "secure": false,
          "description": "Set this value as false to disable the IBM Cloud Monitoring integration. If enabled, infrastructure and LSF application metrics only from management nodes will be captured."
        },
        {
          "name": "observability_monitoring_on_compute_nodes_enable",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set this value as false to disable IBM Cloud Monitoring integration. If enabled, infrastructure metrics from both static and dynamic compute nodes will be captured."
        },
        {
          "name": "observability_monitoring_plan",
          "value": "graduated-tier",
          "type": "string",
          "secure": false,
          "description" : "This is a type of service plan for IBM Cloud Monitoring instance. You can choose one of the following: lite or graduated-tier. For all details visit [IBM Cloud Monitoring Service Plans](https://cloud.ibm.com/docs/monitoring?topic=monitoring-service_plans)."
        },
        {
          "name": "observability_atracker_enable",
          "value": "true",
          "type": "bool",
          "secure": false,
          "description": "Configures Activity Tracker Event Routing to determine how audit events routed. While multiple Activity Tracker Event Routing can be created, only one is needed to capture all events. If an existing Activity Tracker is already integrated with a COS bucket or IBM Cloud Logs instance, set this value to false to avoid creating redundant trackers. All events can then be monitored and accessed through the existing tracker."
        },
        {
          "name": "observability_atracker_target_type",
          "value": "cloudlogs",
          "type": "string",
          "secure": false,
          "description": "Determines where all events can be stored based on the user input. Select the desired target type to retrieve or capture events into your system."
        },
        {
          "name": "observability_logs_enable_for_management",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set this value as false to disable the IBM Cloud Logs integration. If enabled, infrastructure and LSF application logs from management nodes will be captured."
        },
        {
          "name": "observability_logs_enable_for_compute",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set this value as false to disables the IBM Cloud Logs integration. If enabled, infrastructure and LSF application logs from compute nodes (static nodes or worker nodes) will be captured."
        },
        {
          "name": "observability_enable_platform_logs",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Setting this value as true creates a tenant in the same region in which the IBM® Cloud Logs instance is provisioned to enable platform logs for that region. NOTE: You can only have 1 tenant per region in an account."
        },
        {
          "name": "observability_enable_metrics_routing",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Enable the metrics routing to manage metrics at the account level by configuring targets and routes that define how the data points are routed."
        },
        {
          "name": "observability_logs_retention_period",
          "value": "7",
          "type": "number",
          "secure": false,
          "description": "The number of days IBM Cloud Logs retains the logs data in priority insights. By default the value is set as 7, but the allowed values are 14, 30, 60, and 90."
        },
        {
          "name": "existing_bastion_instance_name",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Provide the name of the bastion instance. If none given then new bastion will be created."
        },
        {
          "name": "existing_bastion_instance_public_ip",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Provide the public ip address of the bastion instance to establish the remote connection."
        },
        {
          "name": "existing_bastion_security_group_id",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Provide the security group ID of the bastion server. This security group ID will be added as an allowlist rule on the HPC cluster nodes to establish an SSH connection through the bastion node."
        },
        {
          "name": "existing_bastion_ssh_private_key",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Provide the private SSH key (named id_rsa) used during the creation and configuration of the bastion server to securely authenticate and connect to the bastion server. This allows access to internal network resources from a secure entry point. Note: The corresponding public SSH key (named id_rsa.pub) must already be available in the ~/.ssh/authorized_keys file on the bastion host to establish authentication."
        }
      ]
    }
  ]
}
