{
  "name": "hpcaas-test",
  "type": [
    "terraform_v1.5"
  ],
  "location": "eu-de",
  "resource_group": "Default",
  "description": "",
  "tags": [],
  "template_repo": {
    "url": "https://github.com/terraform-ibm-modules/terraform-ibm-hpc",
    "branch": "main"
  },
  "template_data": [
    {
      "folder": "solutions/hpc",
      "type": "terraform_v1.9",
      "env_values":[
        {
          "TF_CLI_ARGS_apply": "-parallelism=250"
        },
        {
          "TF_CLI_ARGS_plan": "-parallelism=250"
        },
        {
          "TF_CLI_ARGS_destroy": "-parallelism=100"
        },
        {
          "VAR1":"<val1>"
        },
        {
          "VAR2":"<val2>"
        }
      ],
      "variablestore": [
        {
          "name": "TF_PARALLELISM",
          "value": "250",
          "type": "string",
          "secure": false,
          "description": "Parallelism concurrent operations limit. Valid values are between 1 and 256, both inclusive. [Learn more](https://www.terraform.io/docs/internals/graph.html#walking-the-graph)."
        },
        {
          "name": "TF_VERSION",
          "value": "1.9",
          "type": "string",
          "secure": false,
          "description": "The version of the Terraform engine that's used in the Schematics workspace."
        },
        {
          "name": "ibmcloud_api_key",
          "value": "Please fill here",
          "type": "string",
          "secure": true,
          "description": "IBM Cloud API key for the IBM Cloud account where the IBM Cloud HPC cluster needs to be deployed. For more information on how to create an API key, see [Managing user API keys](https://cloud.ibm.com/docs/account?topic=account-userapikey)."
        },
        {
          "name": "resource_group",
          "value": "Default",
          "type": "string",
          "secure": false,
          "description": "Specify the name of the existing resource group in your IBM Cloud account where VPC resources will be deployed. By default, the resource group is set to 'Default.' In some older accounts, it may be 'default,' so please verify the resource group name before proceeding. If the value is set to \\\"null\\\", the automation will create two separate resource groups: 'workload-rg' and 'service-rg.' For more details, see Managing resource groups."

        },
        {
          "name": "zones",
          "value": "[\"us-east-1\"]",
          "type": "list(string)",
          "secure": false,
          "description": "Specify the IBM Cloud zone within the chosen region where the IBM Spectrum LSF cluster will be deployed. A single zone input is required, and the management nodes, file storage shares, and compute nodes will all be provisioned in this zone.[Learn more](https://cloud.ibm.com/docs/vpc?topic=vpc-creating-a-vpc-in-a-different-region#get-zones-using-the-cli)."
        },
        {
          "name": "cluster_prefix",
          "value": "hpcaas",
          "type": "string",
          "secure": false,
          "description": "The prefix is used to name the IBM Cloud LSF cluster and the resources provisioned to build the  cluster instance. Each Spectrum LSF cluster must have a unique name, so ensure the prefix is distinct. It must begin with a lowercase letter and can only include lowercase letters, digits, and hyphens. Hyphens must be followed by a lowercase letter or digit, with no leading, trailing, or consecutive hyphens. The prefix length must be less than 16 characters."
        },
        {
          "name": "cluster_name",
          "value": "Please fill here",
          "type": "string",
          "secure": false,
          "description": "Provide a unique cluster name that LSF uses to configure and group the cluster. Without this name, LSF cannot form a cluster, and the initial deployments will fail. The cluster name can be up to 39 alphanumeric characters and may include underscores (_), hyphens (-), and periods (.). Spaces and other special characters are not allowed. Avoid using the name of any host or user as the cluster name. Note that the cluster name cannot be changed after deployment."
        },
        {
          "name": "ibm_customer_number",
          "value": "__NULL__",
          "type": "string",
          "secure": true,
          "description": "Comma-separated list of the IBM Customer Number(s) (ICN) that is used for the Bring Your Own License (BYOL) entitlement check. For more information on how to find your ICN, see [What is my IBM Customer Number (ICN)?](https://www.ibm.com/support/pages/what-my-ibm-customer-number-icn)."
        },
        {
          "name": "bastion_ssh_keys",
          "value": "[\"Please fill here\"]",
          "type": "list(string)",
          "secure": false,
          "description": "Provide the list of SSH key names configured in your IBM Cloud account to establish a connection to the Spectrum LSF bastion and login node. Make sure the SSH key exists in the same resource group and region where the cluster is being provisioned. To pass multiple SSH keys, use the format [\"key-name-1\", \"key-name-2\"]. If you don't have an SSH key in your IBM Cloud account, you can create one by following the provided .[SSH Keys](https://cloud.ibm.com/docs/vpc?topic=vpc-ssh-keys)."
        },
        {
          "name": "compute_ssh_keys",
          "value": "[\"Please fill here\"]",
          "type": "list(string)",
          "secure": false,
          "description": "Provide the list of SSH key names configured in your IBM Cloud account to establish a connection to the Spectrum LSF cluster node. Ensure the SSH key is present in the same resource group and region where the cluster is being provisioned. To pass multiple SSH keys, use the format [\"key-name-1\", \"key-name-2\"]. If you do not have an SSH key in your IBM Cloud account, create one by following the provided instructions.[SSH Keys](https://cloud.ibm.com/docs/vpc?topic=vpc-ssh-keys)."
        },
        {
          "name": "remote_allowed_ips",
          "value": "[\"Please fill here\"]",
          "type": "list(string)",
          "secure": false,
          "description": "Comma-separated list of IP addresses that can access the IBM Cloud HPC cluster instance through an SSH interface. For security purposes, provide the public IP addresses assigned to the devices that are authorized to establish SSH connections (for example, [\"169.45.117.34\"]). To fetch the IP address of the device, use [https://ipv4.icanhazip.com/](https://ipv4.icanhazip.com/)."
        },
        {
          "name": "vpc_name",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Name of an existing VPC in which the cluster resources will be deployed. If no value is given, then a new VPC will be provisioned for the cluster. [Learn more](https://cloud.ibm.com/docs/vpc)"
        },
        {
          "name": "cluster_subnet_ids",
          "value": "[]",
          "type": "list(string)",
          "secure": false,
          "description": "Provide the list of existing subnet ID under the existing VPC where the cluster will be provisioned. One subnet ID is required as input value. The management nodes, file storage shares, and compute nodes will be deployed in the same zone."
        },
        {
          "name": "login_subnet_id",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Provide the list of existing subnet ID under the existing VPC, where the login/bastion server will be provisioned. One subnet id is required as input value for the creation of login node and bastion in the same zone as the management nodes. Note: Provide a different subnet id for login_subnet_id, do not overlap or provide the same subnet id that was already provided for cluster_subnet_ids."
        },
        {
          "name": "vpc_cidr",
          "value": "10.241.0.0/18",
          "type": "string",
          "secure": false,
          "description": "Creates the address prefix for the new VPC, when the vpc_name variable is empty. The VPC requires an address prefix for creation of subnet in a single zone. The subnet are created with the specified CIDR blocks. For more information, see [Setting IP ranges](https://cloud.ibm.com/docs/vpc?topic=vpc-vpc-addressing-plan-design)."
        },
        {
          "name": "vpc_cluster_private_subnets_cidr_blocks",
          "value": "[\"10.241.0.0/20\"]",
          "type": "list(string)",
          "secure": false,
          "description": "Provide the CIDR block required for the creation of the compute cluster's private subnet. One CIDR block is required. If using a hybrid environment, modify the CIDR block to avoid conflicts with any on-premises CIDR blocks. Ensure the selected CIDR block size can accommodate the maximum number of management and dynamic compute nodes expected in your cluster. For more information on CIDR block size selection, refer to the documentation, see [Choosing IP ranges for your VPC](https://cloud.ibm.com/docs/vpc?topic=vpc-choosing-ip-ranges-for-your-vpc)."
        },
        {
          "name": "vpc_cluster_login_private_subnets_cidr_blocks",
          "value": "[\"10.241.16.0/28\"]",
          "type": "list(string)",
          "secure": false,
          "description": "Provide the CIDR block required for the creation of the login cluster's private subnet. Only one CIDR block is needed. If using a hybrid environment, modify the CIDR block to avoid conflicts with any on-premises CIDR blocks. Since the login subnet is used only for the creation of login virtual server instances, provide a CIDR range of /28."
        },
        {
          "name": "dns_domain_name",
          "value": "{compute= \"lsf.com\"}",
          "type": "object({compute = string})",
          "secure": false,
          "description": "IBM Cloud DNS Services domain name to be used for the IBM Cloud HPC cluster."
        },
        {
          "name": "dns_instance_id",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Provide the ID of an existing IBM Cloud DNS service instance to avoid creating a new one. Note: If dns_instance_id is not set to null, a new DNS zone will be created within the specified DNS service instance."
        },
        {
          "name": "dns_custom_resolver_id",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Provide the id of existing IBM Cloud DNS custom resolver to skip creating a new custom resolver. If the value is set to null, a new dns custom resolver shall be created and associated to the vpc. Note: A VPC can be associated only to a single custom resolver, please provide the id of custom resolver if it is already associated to the VPC."
        },
        {
          "name": "enable_cos_integration",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set to true to create an extra cos bucket to integrate with HPC cluster deployment."
        },
        {
          "name": "cos_instance_name",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Provide the name of the existing cos instance to store vpc flow logs."
        },
        {
          "name": "enable_fip",
          "value": "true",
          "type": "bool",
          "secure": false,
          "description": "The solution supports multiple ways to connect to your IBM Cloud HPC cluster for example, using a login node, or using VPN or direct connection. If connecting to the IBM Cloud HPC cluster using VPN or direct connection, set this value to false."
        },
        {
          "name": "management_image_name",
          "value": "hpcaas-lsf10-rhel810-v1",
          "type": "string",
          "secure": false,
          "description": "Name of the custom image that you want to use to create virtual server instances in your IBM Cloud account to deploy the IBM Cloud Spectrum LSF cluster management nodes. By default, the solution uses a RHEL810 base image with additional software packages mentioned [here](https://cloud.ibm.com/docs/ibm-spectrum-lsf#create-custom-image). If you would like to include your application-specific binary files, follow the instructions in [ Planning for custom images ](https://cloud.ibm.com/docs/vpc?topic=vpc-planning-custom-images) to create your own custom image and use that to build the lsf cluster through this offering."
        },
        {
          "name": "compute_image_name",
          "value": "hpcaas-lsf10-rhel810-compute-v8",
          "type": "string",
          "secure": false,
          "description": "Name of the custom image that you want to use to create virtual server instances in your IBM Cloud account to deploy the IBM Cloud Spectrum LSF cluster compute (static/dynamic) nodes. By default, the solution uses a RHEL 8-10 base OS image with additional software packages mentioned [here](https://cloud.ibm.com/docs/ibm-spectrum-lsf#create-custom-image). If you would like to include your application-specific binary files, follow the instructions in [ Planning for custom images ](https://cloud.ibm.com/docs/vpc?topic=vpc-planning-custom-images) to create your own custom image and use that to build the lsf cluster through this offering."

        },
        {
          "name": "login_image_name",
          "value": "hpcaas-lsf10-rhel810-compute-v8",
          "type": "string",
          "secure": false,
          "description": "Name of the custom image that you want to use to create virtual server instances in your IBM Cloud account to deploy the IBM Cloud Spectrum LSF cluster login node. By default, the solution uses a RHEL 8-10 OS image with additional software packages mentioned [here](https://cloud.ibm.com/docs/ibm-spectrum-lsf#create-custom-image). If you would like to include your application-specific binary files, follow the instructions in [ Planning for custom images ](https://cloud.ibm.com/docs/vpc?topic=vpc-planning-custom-images) to create your own custom image and use that to build the lsf cluster through this offering."
        },
        {
          "name": "login_node_instance_type",
          "value": "bx2-2x8",
          "type": "string",
          "secure": false,
          "description": "Specify the virtual server instance profile type to be used to create the login node for the IBM Cloud HPC cluster. For choices on profile types, see [Instance profiles](https://cloud.ibm.com/docs/vpc?topic=vpc-profiles)."
        },
        {
          "name": "worker_node_instance_type",
          "value": "[{count = 0, instance_type = \"bx2-4x16\" }, {count = 0, instance_type = \"cx2-4x16\"}]",
          "type": "list(object({count = number,instance_type = string}))",
          "secure": false,
          "description": "The minimum number of worker nodes represents the static nodes provisioned during cluster creation. The solution supports different instance types, so specify the node count based on the requirements for each instance profile. For dynamic node provisioning, the automation will select the first profile from the list. Ensure sufficient account-level capacity if specifying a higher instance profile.For choices on profile types, see [Instance profiles](https://cloud.ibm.com/docs/vpc?topic=vpc-profiles)."
        },
        {
          "name": "worker_node_max_count",
          "value": "10",
          "type": "number",
          "secure": false,
          "description": "The maximum number of worker nodes that can be deployed in the Spectrum LSF cluster. In order to use the [Resource Connector](https://www.ibm.com/docs/en/spectrum-lsf/10.1.0?topic=lsf-resource-connnector) feature to dynamically create and delete worker nodes based on workload demand, the value selected for this parameter must be larger than the totall count of worker_node_instance_type. If you plan to deploy only static worker nodes in the LSF cluster."
        },
        {
          "name": "management_node_instance_type",
          "value": "bx2-16x64",
          "type": "string",
          "secure": false,
          "description" : "Specify the virtual server instance profile type to be used to create the management nodes for the IBM Spectrum LSF cluster. For choices on profile types, see [Instance profiles](https://cloud.ibm.com/docs/vpc?topic=vpc-profiles)."
        },
        {
          "name": "management_node_count",
          "value": "2",
          "type": "number",
          "secure": false,
          "description": "Number of management nodes. This is the total number of management nodes. Enter a value between 1 and 10."
        },
        {
          "name": "custom_file_shares",
          "value": "[{mount_path = \"/mnt/vpcstorage/tools\", size = 100, iops = 2000 }, { mount_path = \"/mnt/vpcstorage/data\", size = 100, iops = 6000 }, { mount_path = \"/mnt/scale/tools\", nfs_share = \"\" }]",
          "type": "list(object({mount_path = string,size = optional(number),iops = optional(number),nfs_share = optional(string)}))",
          "secure": false,
          "description": "Provide details for customizing your shared file storage layout, including mount points, sizes (in GB), and IOPS ranges for up to five file shares if using VPC file storage as the storage option.If using IBM Storage Scale as an NFS mount, update the appropriate mount path and nfs_share values created from the Storage Scale cluster. Note that VPC file storage supports attachment to a maximum of 256 nodes. Exceeding this limit may result in mount point failures due to attachment restrictions.For more information, see [Storage options](https://test.cloud.ibm.com/docs/hpc-ibm-spectrumlsf?topic=hpc-ibm-spectrumlsf-integrating-scale#integrate-scale-and-hpc)."
        },
        { "name": "storage_security_group_id",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description" : "Provide the storage security group ID from the Spectrum Scale storage cluster if the mount_path in the cluster_file_share variable is set to use Scale fileset mount points. This security group is essential for establishing connections between the Spectrum LSF cluster nodes and NFS mount points, ensuring the nodes can access the specified mount points."
        },
        {
          "name": "hyperthreading_enabled",
          "value": "true",
          "type": "bool",
          "secure": false,
          "description": "Enabling this setting (true by default) allows hyper-threading on the nodes of the cluster, improving overall processing efficiency by permitting each CPU core to execute multiple threads simultaneously. If set to false, hyperthreading will be disabled, which may be preferable for certain workloads requiring dedicated, non-threaded CPU resources for optimal performance. Carefully consider the nature of your computational tasks when configuring this option to achieve the best balance between performance and resource utilization."
        },
        {
          "name": "vpn_enabled",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set the value as true to deploy a VPN gateway for VPC in the cluster."
        },
        {
          "name": "key_management",
          "value": "key_protect",
          "type": "string",
          "secure": false,
          "description": "Set the value as key_protect to enable customer managed encryption for boot volume and file share. If the key_management is set as null, IBM Cloud resources will be always be encrypted through provider managed."
        },
        {
          "name": "kms_instance_name",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Provide the name of the existing Key Protect instance associated with the Key Management Service. Note: To use existing kms_instance_name set key_management as key_protect. The name can be found under the details of the KMS, see [View key-protect ID](https://cloud.ibm.com/docs/key-protect?topic=key-protect-retrieve-instance-ID&interface=ui)."
        },
        {
          "name": "kms_key_name",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description": "Provide the existing kms key name that you want to use for the IBM Cloud HPC cluster. Note: kms_key_name to be considered only if key_management value is set as key_protect.(for example kms_key_name: my-encryption-key)."
        },
        {
          "name": "enable_app_center",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set to true to enable the IBM Spectrum LSF Application Center GUI (default: false). [System requirements](https://www.ibm.com/docs/en/slac/10.2.0?topic=requirements-system-102-fix-pack-14) for IBM Spectrum LSF Application Center Version 10.2 Fix Pack 14."
        },
        {
          "name": "app_center_gui_pwd",
          "value": "",
          "type": "string",
          "secure": true,
          "description": "Password for IBM Spectrum LSF Application Center GUI. Note: Password should be at least 8 characters, must have one number, one lowercase letter, one uppercase letter, and at least one special character."
        },
        {  "name": "app_center_high_availability",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set to false to disable the IBM Spectrum LSF Application Center GUI High Availability (default: true)."
        },
        {  "name": "app_center_existing_certificate_instance",
          "value": "",
          "type": "string",
          "secure": false,
          "description": "When app_center_high_availability is enable/set as true, The Application Center will be configured for high availability and requires a Application Load Balancer Front End listener to use a certificate CRN value stored in the Secret Manager. Provide the valid 'existing_certificate_instance' to configure the Application load balancer."
        },
        {
          "name": "enable_vpc_flow_logs",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "This flag determines whether VPC flow logs are enabled. When set to true, a flow log collector will be created to capture and monitor network traffic data within the VPC. Enabling flow logs provides valuable insights for troubleshooting, performance monitoring, and security auditing by recording information about the traffic passing through your VPC. Consider enabling this feature to enhance visibility and maintain robust network management practices."
        },
        {
          "name": "enable_ldap",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set this option to true to enable LDAP for IBM Cloud HPC, with the default value set to false."
        },
        {
          "name": "ldap_basedns",
          "value": "lsf.com",
          "type": "string",
          "secure": false,
          "description": "The dns domain name is used for configuring the LDAP server. If an LDAP server is already in existence, ensure to provide the associated DNS domain name."
        },
        {
          "name": "ldap_server",
          "value": "null",
          "type": "string",
          "secure": false,
          "description": "Provide the IP address for the existing LDAP server. If no address is given, a new LDAP server will be created."
        },
        {
          "name": "ldap_server_cert",
          "value": "null",
          "type": "string",
          "secure": true,
          "description": "Provide the current LDAP server certificate. This is required if 'ldap_server' is not set to 'null'; otherwise, the LDAP configuration will not succeed."
        },
        {
          "name": "ldap_admin_password",
          "value": "",
          "type": "string",
          "secure": true,
          "description": "The LDAP administrative password should be 8 to 20 characters long, with a mix of at least three alphabetic characters, including one uppercase and one lowercase letter. It must also include two numerical digits and at least one special character from (~@_+:) are required. It is important to avoid including the username in the password for enhanced security.[This value is ignored for an existing LDAP server]."
        },
        {
          "name": "ldap_user_name",
          "value": "",
          "type": "string",
          "secure": false,
          "description": "Custom LDAP User for performing cluster operations. Note: Username should be between 4 to 32 characters, (any combination of lowercase and uppercase letters).[This value is ignored for an existing LDAP server]"
        },
        {
          "name": "ldap_user_password",
          "value": "",
          "type": "string",
          "secure": true,
          "description": "The LDAP user password should be 8 to 20 characters long, with a mix of at least three alphabetic characters, including one uppercase and one lowercase letter. It must also include two numerical digits and at least one special character from (~@_+:) are required.It is important to avoid including the username in the password for enhanced security.[This value is ignored for an existing LDAP server]."
        },
        {
          "name": "ldap_vsi_profile",
          "value": "cx2-2x4",
          "type": "string",
          "secure": false,
          "description": "Profile to be used for LDAP virtual server instance."
        },
        {
          "name": "ldap_vsi_osimage_name",
          "value": "ibm-ubuntu-22-04-4-minimal-amd64-3",
          "type": "string",
          "secure": false,
          "description": "Image name to be used for provisioning the LDAP instances."
        },
        {
          "name": "skip_iam_block_storage_authorization_policy",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set to false if authorization policy is required for VPC block storage volumes to access kms. This can be set to true if authorization policy already exists. For more information on how to create authorization policy manually, see [creating authorization policies for block storage volume](https://cloud.ibm.com/docs/vpc?topic=vpc-block-s2s-auth&interface=ui)."
        },
        {
          "name": "skip_iam_share_authorization_policy",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set it to false if authorization policy is required for VPC file share to access kms. This can be set to true if authorization policy already exists. For more information on how to create authorization policy manually, see [creating authorization policies for VPC file share](https://cloud.ibm.com/docs/vpc?topic=vpc-file-s2s-auth&interface=ui)."
        },
        {
          "name": "scc_enable",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Flag to enable SCC instance creation. If true, an instance of SCC (Security and Compliance Center) will be created."
        },
        {
          "name": "scc_profile",
          "value": "CIS IBM Cloud Foundations Benchmark v1.1.0",
          "type": "string",
          "secure": false,
          "description": "Profile to be set on the SCC Instance (accepting empty, 'CIS IBM Cloud Foundations Benchmark v1.1.0' and 'IBM Cloud Framework for Financial Services')"
        },
        {
          "name": "scc_location",
          "value": "us-south",
          "type": "string",
          "secure": false,
          "description": "Location where the SCC instance is provisioned (possible choices 'us-south', 'eu-de', 'ca-tor', 'eu-es')"
        },
        {
          "name": "scc_event_notification_plan",
          "value": "lite",
          "type": "string",
          "secure": false,
          "description": "Event Notifications Instance plan to be used (it's used with S.C.C. instance), possible values 'lite' and 'standard'"
        },
        { "name": "observability_monitoring_enable",
          "value": "true",
          "type": "bool",
          "secure": false,
          "description": "Set this value as false to disable the IBM Cloud Monitoring integration. If enabled, infrastructure and LSF application metrics only from management nodes will be captured."
        },
        {
          "name": "observability_monitoring_on_compute_nodes_enable",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set this value as false to disable IBM Cloud Monitoring integration. If enabled, infrastructure metrics from both static and dynamic compute nodes will be captured."
        },
        {
          "name": "observability_monitoring_plan",
          "value": "graduated-tier",
          "type": "string",
          "secure": false,
          "description" : "This is a type of service plan for IBM Cloud Monitoring instance. You can choose one of the following: lite or graduated-tier. For all details visit [IBM Cloud Monitoring Service Plans](https://cloud.ibm.com/docs/monitoring?topic=monitoring-service_plans)."
        },
        {
          "name": "observability_atracker_enable",
          "value": "true",
          "type": "bool",
          "secure": false,
          "description": "Configures Activity Tracker Event Routing to determine how audit events routed. While multiple Activity Tracker Event Routing can be created, only one is needed to capture all events. If an existing Activity Tracker is already integrated with a COS bucket or IBM Cloud Logs instance, set this value to false to avoid creating redundant trackers. All events can then be monitored and accessed through the existing tracker."
        },
        {
          "name": "observability_atracker_target_type",
          "value": "cloudlogs",
          "type": "string",
          "secure": false,
          "description": "Determines where all events can be stored based on the user input. Select the desired target type to retrieve or capture events into your system."
        },
        {
          "name": "cos_expiration_days",
          "value": "30",
          "type": "number",
          "secure": false,
          "description": "Specify the retention period for objects in COS buckets by setting the number of days after their creation for automatic expiration. This configuration helps manage storage efficiently by removing outdated or unnecessary data, reducing storage costs, and maintaining data lifecycle policies. Ensure that the specified duration aligns with your data retention and compliance requirements."
        },
        {
          "name": "observability_logs_enable_for_management",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set this value as false to disable the IBM Cloud Logs integration. If enabled, infrastructure and LSF application logs from management nodes will be captured."
        },
        {
          "name": "observability_logs_enable_for_compute",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set this value as false to disables the IBM Cloud Logs integration. If enabled, infrastructure and LSF application logs from compute nodes (static nodes or worker nodes) will be captured."
        },
        {
          "name": "observability_enable_platform_logs",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Setting this value as true creates a tenant in the same region in which the IBM® Cloud Logs instance is provisioned to enable platform logs for that region. NOTE: You can only have 1 tenant per region in an account."
        },
        {
          "name": "observability_enable_metrics_routing",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Enable the metrics routing to manage metrics at the account level by configuring targets and routes that define how the data points are routed."
        },
        {
          "name": "observability_logs_retention_period",
          "value": "7",
          "type": "number",
          "secure": false,
          "description": "The number of days IBM Cloud Logs retains the logs data in priority insights. By default the value is set as 7, but the allowed values are 14, 30, 60, and 90."
        },
        {
          "name": "skip_flowlogs_s2s_auth_policy",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Skip auth policy between flow logs service and COS instance, set to true if this policy is already in place on account."
        },
        {
          "name": "enable_dedicated_host",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set this option to true to enable dedicated hosts for the VSI created for workload servers. The default value is false. When a dedicated host is enabled, the solution supports only static worker nodes with a single profile, and multiple profile combinations are not supported. For example, you can select a profile from a single family, such as bx2, cx2, or mx2. If you are provisioning a static cluster with a third-generation profile, ensure that dedicated hosts are supported in the chosen regions, as not all regions support dedicated hosts for third-gen profiles. To learn more about dedicated host, [click here.](https://cloud.ibm.com/docs/vpc?topic=vpc-dh-profiles&interface=ui)."
        },
        {
          "name": "bastion_instance_name",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description" : "Provide the name of the bastion instance. If none given then new bastion will be created."
        },
        {
          "name": "bastion_instance_public_ip",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description" : "Provide the public ip address of the bastion instance to establish the remote connection."
        },
        {
          "name": "bastion_security_group_id",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description" : "Specify the security group ID for the bastion server. This ID will be added as an allowlist rule on the HPC cluster nodes to facilitate secure SSH connections through the bastion node. By restricting access through a bastion server, this setup enhances security by controlling and monitoring entry points into the cluster environment. Ensure that the specified security group is correctly configured to permit only authorized traffic for secure and efficient management of cluster resources."
        },
        {
          "name": "bastion_ssh_private_key",
          "value": "__NULL__",
          "type": "string",
          "secure": false,
          "description" : "Provide the private SSH key (named id_rsa) used during the creation and configuration of the bastion server to securely authenticate and connect to the bastion server. This allows access to internal network resources from a secure entry point. Note: The corresponding public SSH key (named id_rsa.pub) must already be available in the ~/.ssh/authorized_keys file on the bastion host to establish authentication."
        }
      ]
    }
  ]
}
